표 형식의 데이터를 재배치하는 다양한 기본 연산이 존재하는데, 이런 연산을 재형성(reshaping) 또는 *피벗 연산* 이라고 한다.

계층적 색인은 다음과 같은 DataFrame의 데이터를 재배피하는 한결같은 방식을 제공한다.
- stack: 데이터의 컬럼을 로우로 피벗 또는 회전시킨다.
- unstack: 로우를 컬럼으로 피벗시킨다.

In [2]:
import numpy as np
import pandas as pd

In [8]:
data = pd.DataFrame(np.arange(6).reshape(2,3),
                   index=pd.Index(['Ohio','Colorado'], name='state'),
                   columns=pd.Index(['one','two','three'], name='number'))
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

`stack` 메서드를 사용하면 컬럼이 로우로 피벗되어 다음과 같은 Series 객체를 반환한다.

In [9]:
result = data.stack()

In [13]:
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int64

In [11]:
pd.DataFrame(result)

                 0
state    number
Ohio     one     0
         two     1
         three   2
Colorado one     3
         two     4
         three   5

`unstack` 메서드를 사용하면 위에서 얻은 계층적 색인을 가진 Series로부터 DataFrame을 얻을 수 있다.

In [12]:
result.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

보통 가장 안쪽에 있는 것부터 끄집어내는데(stack도 마찬가지다). 레벨이름이나 숫자를 전달해서 끄집어낼 단계를 지정할 수 있다.

In [14]:
result.unstack(0)

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [15]:
result.unstack('state')

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [16]:
result.unstack(1)

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5